Revit 2027 API
ParameterTypeId.MaterialAssetParamAssetLibId Property
 "Asset library id"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MaterialAssetParamAssetLibId { get; }
Public Shared ReadOnly Property MaterialAssetParamAssetLibId As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MaterialAssetParamAssetLibId {
	ForgeTypeId^ get ();
}
static member MaterialAssetParamAssetLibId : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace